@justinretzolk hello

I just add `storage_ecrypted` set to `true` and then run terraform.

![image](https://github.com/user-attachments/assets/4364c614-c3c9-4b59-99ad-502548fd154b)

Here the full plan which is save to `terraform_${TERRAFORM_WORKSPACE}.tfplan`
```
$ terraform init
Initializing the backend...
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/local versions matching "~> 2.5.1"...
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/tls...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.61.0...
- Installed hashicorp/aws v5.61.0 (signed by HashiCorp)
- Installing hashicorp/local v2.5.1...
- Installed hashicorp/local v2.5.1 (signed by HashiCorp)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed by HashiCorp)
- Installing hashicorp/tls v4.0.5...
- Installed hashicorp/tls v4.0.5 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
Terraform has been successfully initialized!
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.
If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
$ terraform workspace select ${TERRAFORM_WORKSPACE} || terraform workspace new ${TERRAFORM_WORKSPACE}
Switched to workspace "prod".
$ terraform plan -refresh=true -out=terraform_${TERRAFORM_WORKSPACE}.tfplan
random_password.oracle_password: Refreshing state... [id=none]
tls_private_key.pep_key_pair: Refreshing state... [id=3b290ad5a01818a38a424fcc4ab78b44b2efd8b5]
random_password.opensearch_password: Refreshing state... [id=none]
aws_iam_role.opsora: Refreshing state... [id=opsora]
aws_iam_user.pepdump: Refreshing state... [id=pepdump]
aws_s3_bucket.gitlabrunner: Refreshing state... [id=pca-newcat-gitlabrunner]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecsTaskRole]
aws_key_pair.gitrun_ssh_key: Refreshing state... [id=gitrun]
aws_vpc.vpc: Refreshing state... [id=vpc-0f9756ca34ab3c979]
aws_db_option_group.pca-oracle-se2-19: Refreshing state... [id=pca-oracle-se2-19]
aws_cloudwatch_log_group.opensearch-application-log: Refreshing state... [id=/pca-newcat/opensearch/application]
aws_cloudwatch_event_rule.at_08pm: Refreshing state... [id=every_day_at_08pm]
aws_s3_bucket.opensearch-snapshot: Refreshing state... [id=pca-newcat-opensearch-snapshot]
aws_iam_role.pep: Refreshing state... [id=pep]
aws_iam_role.backup: Refreshing state... [id=backup]
aws_secretsmanager_secret.artifactory_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:artifactory-pca-newcat-password-2-e0q4as]
aws_dynamodb_table.teleport_locks: Refreshing state... [id=teleport-locks]
aws_ssm_patch_baseline.redhat-baseline: Refreshing state... [id=pb-064fc2734dc6aaa7c]
aws_secretsmanager_secret.oracle_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:pep-db-password-dE2XQK]
aws_dynamodb_table.teleport: Refreshing state... [id=teleport]
aws_iam_role.rds-s3-integration-role: Refreshing state... [id=rds-s3-integration-role]
aws_acm_certificate.teleport_public_zone_cert: Refreshing state... [id=arn:aws:acm:eu-west-3:590183738523:certificate/48d6dd61-2dc5-4c86-b2be-75b86ba7411b]
aws_s3_bucket.ssm: Refreshing state... [id=pca-newcat-ssm]
aws_cloudwatch_log_group.lambda-ec2-start: Refreshing state... [id=/pca-newcat/lambda/ec2-start-instance]
aws_vpc_dhcp_options.vpc_dhcp_options: Refreshing state... [id=dopt-0e477beaacf637744]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecsTaskExecutionRole]
aws_sns_topic.sns: Refreshing state... [id=arn:aws:sns:eu-west-3:590183738523:pca-newcat]
aws_route53_zone.teleport_public_zone: Refreshing state... [id=Z07280202K774TQVZCXQW]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=590183738523]
aws_s3_bucket.alb: Refreshing state... [id=pca-newcat-alb]
aws_key_pair.opsora_ssh_key: Refreshing state... [id=opsora]
aws_acm_certificate.main_public_zone_cert: Refreshing state... [id=arn:aws:acm:eu-west-3:590183738523:certificate/69248c4e-c5c9-4afb-9d21-5f20c0b8c6e4]
aws_cloudwatch_log_group.ec2-teleport: Refreshing state... [id=/pca-newcat/ec2/plzzotelprt01aw]
aws_route53_zone.main_public_zone: Refreshing state... [id=Z09050255BFSKXYQ1CGY]
aws_cloudwatch_event_rule.at_07am: Refreshing state... [id=every_day_at_07am]
aws_iam_role.teleport: Refreshing state... [id=teleport]
aws_dynamodb_table.teleport_events: Refreshing state... [id=teleport-events]
aws_cloudwatch_log_group.opensearch-searchslow-log: Refreshing state... [id=/pca-newcat/opensearch/search-slow]
aws_cloudwatch_log_group.ec2-opsora: Refreshing state... [id=/pca-newcat/ec2/plzzoopsora01aw]
aws_cloudwatch_log_group.opensearch-indexslow-log: Refreshing state... [id=/pca-newcat/opensearch/index-slow]
aws_s3_bucket.rds-s3-integration-bucket: Refreshing state... [id=pca-newcat-rds-integration]
aws_cloudwatch_log_group.redis-slow-log: Refreshing state... [id=/pca-newcat/redis/slow]
aws_cloudwatch_log_group.ec2-pep: Refreshing state... [id=/pca-newcat/ec2/pwzzapepweb01aw]
aws_s3_bucket.teleport: Refreshing state... [id=pca-newcat-teleport]
aws_cloudwatch_log_group.lambda-sns2slack: Refreshing state... [id=/pca-newcat/lambda/sns2slack]
aws_cloudwatch_log_group.ec2-gitlab: Refreshing state... [id=/pca-newcat/ec2/plzzogitrun01aw]
aws_s3_bucket.pca_newcat_elasticdump: Refreshing state... [id=pca-newcat-elasticdump]
aws_cloudwatch_log_group.lambda-ec2-stop: Refreshing state... [id=/pca-newcat/lambda/ec2-stop-instance]
aws_iam_role.lambda: Refreshing state... [id=lambda]
aws_iam_role.gitrun: Refreshing state... [id=gitrun]
aws_cloudwatch_log_group.redis-engine-log: Refreshing state... [id=/pca-newcat/redis/engine]
aws_iam_user.elasticdump: Refreshing state... [id=elasticdump]
aws_secretsmanager_secret.opensearch_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:opensearch-db-password-0xcVyr]
aws_key_pair.pep_key_pair: Refreshing state... [id=pep-windows]
aws_iam_user.freshservice: Refreshing state... [id=freshservice]
aws_service_discovery_http_namespace.pca_newcat_ecs_namespace: Refreshing state... [id=ns-cbjwwytd6ybkivuc]
aws_secretsmanager_secret.windows_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:pep-windows-password-lZRzls]
aws_ssm_patch_baseline.windowsbaseline: Refreshing state... [id=pb-0fca3087b37dbdd92]
aws_backup_vault.backup-vault: Refreshing state... [id=backup-vault]
aws_db_parameter_group.pca-oracle-se2-19: Refreshing state... [id=pca-oracle-se2-19]
aws_key_pair.teleport_ssh_key: Refreshing state... [id=teleport]
aws_iam_role.opensearch-snapshot: Refreshing state... [id=opensearch-snapshot]
aws_cloudwatch_log_group.ecs-log: Refreshing state... [id=/pca-newcat/ecs]
aws_secretsmanager_secret_version.artifactory_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:artifactory-pca-newcat-password-2-e0q4as|terraform-20240719122628651000000002]
aws_s3_bucket_ownership_controls.gitlabrunner: Refreshing state... [id=pca-newcat-gitlabrunner]
aws_s3_bucket_versioning.gitlabrunner: Refreshing state... [id=pca-newcat-gitlabrunner]
aws_s3_bucket_public_access_block.gitlabrunner: Refreshing state... [id=pca-newcat-gitlabrunner]
aws_secretsmanager_secret_version.oracle_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:pep-db-password-dE2XQK|terraform-20240702100922694400000003]
aws_s3_bucket_server_side_encryption_configuration.gitlabrunner: Refreshing state... [id=pca-newcat-gitlabrunner]
data.aws_iam_policy_document.opensearch-cloudwatch-policy: Reading...
data.aws_iam_policy_document.opensearch-access-policy: Reading...
data.aws_iam_policy_document.opensearch-cloudwatch-policy: Read complete after 0s [id=2006450403]
data.aws_iam_policy_document.opensearch-access-policy: Read complete after 0s [id=3536769954]
aws_internet_gateway.ig: Refreshing state... [id=igw-0131cc7dee14b22c2]
aws_cloudwatch_metric_alarm.rds-oracle-freespace: Refreshing state... [id=pca-newcat-rds-oracle-freespace]
aws_subnet.public_subnet["az_a"]: Refreshing state... [id=subnet-0480b0118aebf57fa]
aws_lb_target_group.teleport_windows: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:targetgroup/tg-teleport-windows/64499cf2[33](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L33)ea9997]
aws_lb_target_group.teleport_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:targetgroup/tg-teleport-ssh/56235f41271[34](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L34)77d]
aws_vpc_dhcp_options_association.dchp_association: Refreshing state... [id=dopt-0e477beaacf637744-vpc-0f9756ca34ab3c979]
aws_subnet.public_subnet["az_b"]: Refreshing state... [id=subnet-0aa0103d2dcf4ffbb]
aws_subnet.public_subnet["az_c"]: Refreshing state... [id=subnet-0896bf70bea36a28b]
aws_lb_target_group.teleport_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:targetgroup/tg-teleport-https/1f21c8fe1e5a488e]
aws_security_group.global: Refreshing state... [id=sg-0c109d47b5bd27ca5]
aws_route53_zone.main_private_zone: Refreshing state... [id=Z0528565FSAX4EAJM03K]
aws_subnet.private_subnet["az_b"]: Refreshing state... [id=subnet-0c50d1060a23362b2]
aws_subnet.private_subnet["az_c"]: Refreshing state... [id=subnet-0671943e700087a2d]
aws_subnet.private_subnet["az_a"]: Refreshing state... [id=subnet-0689f4111785da9d5]
aws_s3_bucket_policy.alb-policy: Refreshing state... [id=pca-newcat-alb]
aws_iam_policy_attachment.backup-backup: Refreshing state... [id=backup-backup]
aws_iam_policy_attachment.backup-restore: Refreshing state... [id=backup-backup]
aws_iam_policy_attachment.cloud_watchlogs_full_access: Refreshing state... [id=cloud-watchlogs-full-access]
aws_iam_policy_attachment.secrets_manager_read_write: Refreshing state... [id=secrets-manager-read-write]
aws_iam_role_policy.opsora_ssm: Refreshing state... [id=opsora:opsora-ssm]
aws_iam_policy_attachment.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role]
aws_iam_instance_profile.opsora: Refreshing state... [id=opsora]
aws_iam_role_policy.ecs_custom_policy: Refreshing state... [id=ecsTaskRole:ecs-custom-policy]
aws_iam_policy_attachment.amazon_s3_full_access: Refreshing state... [id=amazon-s3-full-access]
aws_iam_instance_profile.pep: Refreshing state... [id=pep]
aws_iam_role_policy.pep-vss-backup: Refreshing state... [id=pep:pep-vss-backup]
aws_secretsmanager_secret_version.opensearch_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590183738523:secret:opensearch-db-password-0xcVyr|terraform-20240705071929690300000002]
aws_s3_bucket_lifecycle_configuration.opensearch-snapshot-lifecycle: Refreshing state... [id=pca-newcat-rds-integration]
aws_s3_bucket_lifecycle_configuration.rds-s3-integration-bucket-lifecycle: Refreshing state... [id=pca-newcat-rds-integration]
aws_s3_bucket_versioning.rds-s3-integration-bucket-versioning: Refreshing state... [id=pca-newcat-rds-integration]
aws_iam_role_policy.rds-s3-integration-policy: Refreshing state... [id=rds-s3-integration-role:rds-s3-integration-policy]
aws_iam_user_policy.pepdump_s3: Refreshing state... [id=pepdump:pepdump-s3]
aws_s3_bucket_server_side_encryption_configuration.teleport: Refreshing state... [id=pca-newcat-teleport]
aws_s3_bucket_versioning.teleport: Refreshing state... [id=pca-newcat-teleport]
aws_s3_bucket_ownership_controls.teleport: Refreshing state... [id=pca-newcat-teleport]
aws_s3_bucket_public_access_block.storage: Refreshing state... [id=pca-newcat-teleport]
aws_s3_bucket_lifecycle_configuration.teleport-lifecycle: Refreshing state... [id=pca-newcat-teleport]
aws_route53_record.teleport_public_zone_cert_validation: Refreshing state... [id=Z07280202K774TQVZCXQW__506c5b5d70a5021b6981c57f473d5d4a.teleport.pca.norauto.io._CNAME]
aws_iam_user_policy.elasticdump_s3: Refreshing state... [id=elasticdump:elasticdump-s3]
aws_iam_policy_attachment.freshservice-route53-read: Refreshing state... [id=freshservice-route53-read]
aws_iam_policy_attachment.freshservice-ec2-read: Refreshing state... [id=freshservice-ec2-read]
aws_iam_policy_attachment.freshservice-vpc-read: Refreshing state... [id=freshservice-vpc-read]
aws_iam_policy_attachment.freshservice-rds-read: Refreshing state... [id=freshservice-rds-read]
aws_iam_policy_attachment.freshservice-redis-read: Refreshing state... [id=freshservice-redis-read]
aws_iam_policy_attachment.freshservice-lb-read: Refreshing state... [id=freshservice-lb-read]
aws_iam_policy_attachment.freshservice-opensearch-read: Refreshing state... [id=freshservice-opensearch-read]
aws_iam_policy_attachment.freshservice-s3-read: Refreshing state... [id=freshservice-s3-read]
aws_route53_record.main_public_zone_teleport_delegation: Refreshing state... [id=Z09050255BFSKXYQ1CGY_teleport.pca.norauto.io_NS]
aws_route53_record.main_public_zone_cert_validation: Refreshing state... [id=Z09050255BFSKXYQ1CGY__5136d646ddd1c08d58c6539c82ed6ac9.pca.norauto.io._CNAME]
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:eu-west-3:590183738523:cluster/pca-newcat-ecs]
aws_backup_plan.backup-plan: Refreshing state... [id=1dce2fe1-7ab9-40d9-a3f1-a6add42d0f5a]
aws_cloudwatch_log_resource_policy.opensearch-log-policy: Refreshing state... [id=opensearch-cloudwatch-policy]
aws_s3_bucket_acl.gitlabrunner: Refreshing state... [id=pca-newcat-gitlabrunner,private]
aws_eip.nat_eip["az_a"]: Refreshing state... [id=eipalloc-094d92cdb0c4babd4]
aws_eip.nat_eip["az_b"]: Refreshing state... [id=eipalloc-065c4db078729f34c]
aws_eip.nat_eip["az_c"]: Refreshing state... [id=eipalloc-0b79d50f691d7eda9]
aws_route_table.public_route["az_a"]: Refreshing state... [id=rtb-0042eb845837e9e02]
aws_route_table.public_route["az_b"]: Refreshing state... [id=rtb-084809abd19d915d1]
aws_route_table.public_route["az_c"]: Refreshing state... [id=rtb-0b5ba6b3ddd4a9051]
aws_iam_policy_attachment.lambda-cloudwatch: Refreshing state... [id=lambda-cloudwatch]
aws_iam_role_policy.lambda_ec2: Refreshing state... [id=lambda:lambda-ec2]
aws_lambda_function.lambda_sns2slack: Refreshing state... [id=sns2slack]
aws_lambda_function.lambda_start_ec2: Refreshing state... [id=start_ec2_instance]
aws_lambda_function.lambda_stop_ec2: Refreshing state... [id=stop_ec2_instance]
aws_iam_instance_profile.gitrun: Refreshing state... [id=gitrun]
aws_iam_role_policy.gitrun_ssm: Refreshing state... [id=gitrun:gitrun-ssm]
aws_iam_role_policy.teleport_dynamo: Refreshing state... [id=teleport:teleport-dynamodb]
aws_iam_policy_attachment.aws-ssm-core: Refreshing state... [id=aws-ssm-core]
aws_iam_policy_attachment.ec2-cloudwatch: Refreshing state... [id=ec2_cloudwatch]
aws_iam_role_policy.teleport_route53: Refreshing state... [id=teleport:teleport-route53]
aws_iam_role_policy.teleport_ssm: Refreshing state... [id=teleport:teleport-ssm]
aws_iam_role_policy.teleport_s3: Refreshing state... [id=teleport:teleport-s3]
aws_security_group_rule.ingress_pep: Refreshing state... [id=sgrule-2469716631]
aws_security_group_rule.ingress_rds: Refreshing state... [id=sgrule-998595725]
aws_lb.teleport: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:loadbalancer/net/nlb-teleport/8784cd9db0a5ca24]
aws_security_group_rule.ingress_winrm: Refreshing state... [id=sgrule-3909131301]
aws_lb.ecs: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:loadbalancer/app/alb-ecs/df3fbbf96f117082]
aws_security_group_rule.ingress_redis: Refreshing state... [id=sgrule-3921613498]
aws_security_group_rule.ingress_teleport_web: Refreshing state... [id=sgrule-747949258]
aws_security_group_rule.ingress_teleport_ssh: Refreshing state... [id=sgrule-1262420009]
aws_security_group_rule.ingress_teleport_windows: Refreshing state... [id=sgrule-685410162]
aws_security_group_rule.ingress_rdp: Refreshing state... [id=sgrule-766583105]
aws_security_group_rule.global_egress: Refreshing state... [id=sgrule-27320859]
aws_security_group_rule.ingress_ecs_services: Refreshing state... [id=sgrule-3298397108]
aws_iam_role_policy.opensearch-snapshot-policy: Refreshing state... [id=opensearch-snapshot:opensearch-snapshot-policy]
aws_opensearch_domain.opensearch: Refreshing state... [id=arn:aws:es:eu-west-3:590183738523:domain/pca-newcat-opensearch]
aws_elasticache_subnet_group.cache_private_subnet: Refreshing state... [id=cache-subnet-priv-eu-west-3]
aws_db_subnet_group.db_private_subnet: Refreshing state... [id=db-subnet-priv-eu-west-3]
aws_instance.opsora: Refreshing state... [id=i-0821b3e10097d6a17]
aws_instance.pep: Refreshing state... [id=i-009e193d3e119e4ee]
aws_s3_bucket_acl.teleport: Refreshing state... [id=pca-newcat-teleport,private]
aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=pca-newcat-ecs]
aws_acm_certificate_validation.teleport_public_zone_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_acm_certificate_validation.main_public_zone_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_nat_gateway.natgw["az_a"]: Refreshing state... [id=nat-01e0531be2044a932]
aws_nat_gateway.natgw["az_b"]: Refreshing state... [id=nat-0d1c38fa3f15f4c24]
aws_nat_gateway.natgw["az_c"]: Refreshing state... [id=nat-00fbff2dcf99b9781]
aws_route_table_association.public_subnet_association["az_c"]: Refreshing state... [id=rtbassoc-0a79888c3f421068b]
aws_route_table_association.public_subnet_association["az_a"]: Refreshing state... [id=rtbassoc-021bbe18aa3a3952e]
aws_route_table_association.public_subnet_association["az_b"]: Refreshing state... [id=rtbassoc-064c84cbfbd4ad730]
aws_sns_topic_subscription.sns-subscription: Refreshing state... [id=arn:aws:sns:eu-west-3:590183738523:pca-newcat:c867c664-fbae-44ee-bfba-f95372947f3d]
aws_lambda_permission.allow_sns_to_run_lambda_sns2slack: Refreshing state... [id=AllowExecutionFromSNS]
aws_lambda_permission.allow_eventbridge_to_run_lambda_ec2startinstance: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_lambda_permission.allow_eventbridge_to_run_lambda_ec2stopinstance: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.event_start_to_lambda: Refreshing state... [id=every_day_at_07am-StartInstance]
aws_cloudwatch_event_target.event_stop_to_lambda: Refreshing state... [id=every_day_at_08pm-StopInstance]
aws_instance.gitrun: Refreshing state... [id=i-08b722ae341ac3a92]
aws_iam_instance_profile.teleport: Refreshing state... [id=teleport]
aws_lb_listener.teleport_windows: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:listener/net/nlb-teleport/8784cd9db0a5ca24/8da4b1a2f01a447c]
aws_lb_listener.teleport_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:listener/net/nlb-teleport/8784cd9db0a5ca24/b9b5bee62f3cfbe6]
aws_route53_record.teleport_record_wildcard_nlb: Refreshing state... [id=Z07280202K774TQVZCXQW_*.teleport.pca.norauto.io_A]
aws_route53_record.teleport_record_nlb: Refreshing state... [id=Z07280202K774TQVZCXQW_teleport.pca.norauto.io_A]
aws_route53_record.main_record_wildcard_alb: Refreshing state... [id=Z09050255BFSKXYQ1CGY_*.pca.norauto.io_A]
aws_route53_record.main_record_alb: Refreshing state... [id=Z09050255BFSKXYQ1CGY_pca.norauto.io_A]
aws_db_instance.pep_oracle: Refreshing state... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ]
aws_lb_listener.teleport_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:listener/net/nlb-teleport/8784cd9db0a5ca24/8fc65e44592a65f9]
aws_lb_listener.ecs-https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:listener/app/alb-ecs/df3fbbf96f117082/43942479f253df9c]
aws_elasticache_cluster.redis: Refreshing state... [id=pca-newcat-redis]
aws_route_table.private_route["az_b"]: Refreshing state... [id=rtb-0a85e92cb19f6e754]
aws_route_table.private_route["az_a"]: Refreshing state... [id=rtb-0988[35](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L35)f5bbad8339a]
aws_route_table.private_route["az_c"]: Refreshing state... [id=rtb-0b21[36](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L36)dc6fd13639e]
aws_instance.teleport: Refreshing state... [id=i-002a95f778f415cb2]
aws_db_instance_role_association.s3-integration: Refreshing state... [id=pepdb,arn:aws:iam::59018[37](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L37)38523:role/rds-s3-integration-role]
aws_route_table_association.private_subnet_association["az_b"]: Refreshing state... [id=rtbassoc-09efd9d33d70ba092]
aws_route_table_association.private_subnet_association["az_c"]: Refreshing state... [id=rtbassoc-065b597f94281b760]
aws_route_table_association.private_subnet_association["az_a"]: Refreshing state... [id=rtbassoc-09a779549c300b43f]
aws_secretsmanager_secret_version.windows_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:5901837[38](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L38)523:secret:pep-windows-password-lZRzls|terraform-20240703073743457400000002]
aws_lb_target_group_attachment.teleport_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:targetgroup/tg-teleport-ssh/56235f412713477d-2024062409[39](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L39)14266800000001]
aws_backup_selection.backup-selection: Refreshing state... [id=061ec5f7-3390-48d2-9ce0-3242a1fe4194]
aws_lb_target_group_attachment.teleport_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:targetgroup/tg-teleport-https/1f21c8fe1e5a488e-202[40](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L40)624082746445500000003]
aws_lb_target_group_attachment.teleport_windows: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590183738523:targetgroup/tg-teleport-windows/64499cf233ea9997-20240624082746337800000002]
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
Terraform will perform the following actions:
  # aws_db_instance.pep_oracle must be replaced
-/+ resource "aws_db_instance" "pep_oracle" {
      ~ address                               = "pepdb.cbcaig2gws0i.eu-west-3.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:eu-west-3:590183738523:db:pepdb" -> (known after apply)
      ~ availability_zone                     = "eu-west-3b" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      ~ character_set_name                    = "AL32UTF8" -> (known after apply)
      - customer_owned_ip_enabled             = false -> null
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      ~ endpoint                              = "pepdb.cbcaig2gws0i.eu-west-3.rds.amazonaws.com:1521" -> (known after apply)
      + engine_lifecycle_support              = (known after apply)
      ~ engine_version_actual                 = "19.0.0.0.ru-2024-04.rur-2024-04.r1" -> (known after apply)
      ~ hosted_zone_id                        = "ZMESEXB7ZGGQ3" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 3000 -> (known after apply)
      + kms_key_id                            = (known after apply)
      ~ latest_restorable_time                = "2024-08-07T07:29:19Z" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ nchar_character_set_name              = "AL16UTF16" -> (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
      ~ storage_throughput                    = 125 -> (known after apply)
        tags                                  = {
            "bu"               = "int"
            "createdby"        = "terraform"
            "domain"           = "newcat"
            "env"              = "prod"
            "meta_environment" = "prd"
            "platform"         = "pca-newcat"
            "project"          = "pca-newcat"
            "status"           = "used"
            "team"             = "infra:sysops"
        }
      + timezone                              = (known after apply)
        # (39 unchanged attributes hidden)
    }
Plan: 1 to add, 0 to change, 1 to destroy.
─────────────────────────────────────────────────────────────────────────────
Saved the plan to: terraform_prod.tfplan
To perform exactly these actions, run the following command to apply:
    terraform apply "terraform_prod.tfplan"
$ terraform show --json terraform_${TERRAFORM_WORKSPACE}.tfplan | convert_report > terraform_${TERRAFORM_WORKSPACE}_report.json
$ terraform show --json terraform_${TERRAFORM_WORKSPACE}.tfplan > terraform_${TERRAFORM_WORKSPACE}.tfplan.json
Uploading artifacts for successful job
00:02
Uploading artifacts...
terraform_prod.tfplan: found 1 matching artifact files and directories 
terraform_prod.tfplan.json: found 1 matching artifact files and directories 
terraform_prod_report.json: found 1 matching artifact files and directories 
Uploading artifacts as "archive" to coordinator... 201 Created  id=7523303[43](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303431#L43)1 responseStatus=201 Created token=glcbt-66
Uploading artifacts...
terraform_prod_report.json: found 1 matching artifact files and directories 
Uploading artifacts as "terraform" to coordinator... 201 Created  id=7523303431 responseStatus=201 Created token=glcbt-66
Cleaning up project directory and file based variables
00:01
Job succeeded
```

And then just applying this plan

```
$ terraform init
Initializing the backend...
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/local versions matching "~> 2.5.1"...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding latest version of hashicorp/tls...
- Finding latest version of hashicorp/random...
- Installing hashicorp/local v2.5.1...
- Installed hashicorp/local v2.5.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.61.0...
- Installed hashicorp/aws v5.61.0 (signed by HashiCorp)
- Installing hashicorp/tls v4.0.5...
- Installed hashicorp/tls v4.0.5 (signed by HashiCorp)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
Terraform has been successfully initialized!
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.
If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
$ terraform workspace select ${TERRAFORM_WORKSPACE} || terraform workspace new ${TERRAFORM_WORKSPACE}
Switched to workspace "prod".
$ terraform apply terraform_${TERRAFORM_WORKSPACE}.tfplan
aws_db_instance.pep_oracle: Destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, [40](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303436#L40)s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 1m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 1m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 1m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 1m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 1m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 1m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 2m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 2m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 2m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 2m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 2m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 2m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 3m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 3m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 3m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 3m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 3m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 3m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 4m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 4m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 4m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 4m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 4m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 4m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 5m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 5m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 5m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 5m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 5m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 5m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 6m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 6m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 6m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 6m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 6m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 6m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 7m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 7m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 7m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 7m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 7m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 7m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 8m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 8m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 8m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 8m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 8m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 8m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 9m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 9m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 9m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 9m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 9m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 9m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 10m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 11m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 11m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 11m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 11m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 11m40s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 11m50s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 12m0s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 12m10s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 12m20s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 12m30s elapsed]
aws_db_instance.pep_oracle: Still destroying... [id=db-OBR2TXC7EBHRSNXJ2IPMTOLYEQ, 12m40s elapsed]
aws_db_instance.pep_oracle: Destruction complete after 12m[48](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303436#L48)s
aws_db_instance.pep_oracle: Creating...
aws_db_instance.pep_oracle: Still creating... [10s elapsed]
aws_db_instance.pep_oracle: Still creating... [20s elapsed]
aws_db_instance.pep_oracle: Still creating... [30s elapsed]
aws_db_instance.pep_oracle: Still creating... [40s elapsed]
aws_db_instance.pep_oracle: Still creating... [[50](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7523303436#L50)s elapsed]
aws_db_instance.pep_oracle: Still creating... [1m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [1m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [1m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [1m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [1m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [1m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [2m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [2m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [2m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [2m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [2m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [2m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [3m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [3m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [3m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [3m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [3m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [3m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [4m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [4m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [4m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [4m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [4m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [4m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [5m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [5m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [5m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [5m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [5m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [5m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [6m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [6m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [6m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [6m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [6m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [6m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [7m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [7m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [7m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [7m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [7m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [7m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [8m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [8m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [8m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [8m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [8m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [8m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [9m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [9m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [9m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [9m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [9m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [9m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [10m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [10m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [10m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [10m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [10m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [10m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [11m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [11m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [11m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [11m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [11m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [11m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [12m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [12m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [12m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [12m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [12m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [12m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [13m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [13m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [13m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [13m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [13m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [13m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [14m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [14m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [14m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [14m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [14m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [14m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [15m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [15m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [15m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [15m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [15m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [15m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [16m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [16m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [16m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [16m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [16m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [16m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [17m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [17m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [17m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [17m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [17m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [17m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [18m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [18m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [18m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [18m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [18m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [18m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [19m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [19m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [19m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [19m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [19m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [19m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [20m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [20m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [20m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [20m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [20m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [20m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [21m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [21m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [21m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [21m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [21m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [21m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [22m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [22m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [22m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [22m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [22m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [22m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [23m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [23m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [23m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [23m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [23m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [23m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [24m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [24m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [24m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [24m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [24m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [24m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [25m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [25m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [25m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [25m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [25m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [25m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [26m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [26m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [26m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [26m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [26m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [26m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [27m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [27m10s elapsed]
aws_db_instance.pep_oracle: Still creating... [27m20s elapsed]
aws_db_instance.pep_oracle: Still creating... [27m30s elapsed]
aws_db_instance.pep_oracle: Still creating... [27m40s elapsed]
aws_db_instance.pep_oracle: Still creating... [27m50s elapsed]
aws_db_instance.pep_oracle: Still creating... [28m0s elapsed]
aws_db_instance.pep_oracle: Still creating... [28m10s elapsed]
aws_db_instance.pep_oracle: Creation complete after 28m13s [id=db-7DZVVKNCQC3QX6TZDNUHOMMX6Q]
Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
Cleaning up project directory and file based variables
00:01
Job succeeded
```

I just notice the role association was not set.

I just restart a terraform pipeline which detects the missing role association:

```
$ terraform init
Initializing the backend...
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/local versions matching "~> 2.5.1"...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/tls...
- Installing hashicorp/tls v4.0.5...
- Installed hashicorp/tls v4.0.5 (signed by HashiCorp)
- Installing hashicorp/local v2.5.1...
- Installed hashicorp/local v2.5.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.61.0...
- Installed hashicorp/aws v5.61.0 (signed by HashiCorp)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
Terraform has been successfully initialized!
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.
If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
$ terraform workspace select ${TERRAFORM_WORKSPACE} || terraform workspace new ${TERRAFORM_WORKSPACE}
Switched to workspace "prod".
$ terraform plan -refresh=true -out=terraform_${TERRAFORM_WORKSPACE}.tfplan
[...]
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # aws_db_instance_role_association.s3-integration will be created
  + resource "aws_db_instance_role_association" "s3-integration" {
      + db_instance_identifier = "pepdb"
      + feature_name           = "S3_INTEGRATION"
      + id                     = (known after apply)
      + role_arn               = "arn:aws:iam::590183738523:role/rds-s3-integration-role"
    }
Plan: 1 to add, 0 to change, 0 to destroy.
─────────────────────────────────────────────────────────────────────────────
Saved the plan to: terraform_prod.tfplan
To perform exactly these actions, run the following command to apply:
    terraform apply "terraform_prod.tfplan"
$ terraform show --json terraform_${TERRAFORM_WORKSPACE}.tfplan | convert_report > terraform_${TERRAFORM_WORKSPACE}_report.json
$ terraform show --json terraform_${TERRAFORM_WORKSPACE}.tfplan > terraform_${TERRAFORM_WORKSPACE}.tfplan.json
Uploading artifacts for successful job
00:02
Uploading artifacts...
terraform_prod.tfplan: found 1 matching artifact files and directories 
terraform_prod.tfplan.json: found 1 matching artifact files and directories 
terraform_prod_report.json: found 1 matching artifact files and directories 
Uploading artifacts as "archive" to coordinator... 201 Created  id=75282[42](https://gitlab.com/mobivia/pca-newcat/pca-newcat/-/jobs/7528242810#L42)810 responseStatus=201 Created token=glcbt-66
Uploading artifacts...
terraform_prod_report.json: found 1 matching artifact files and directories 
Uploading artifacts as "terraform" to coordinator... 201 Created  id=7528242810 responseStatus=201 Created token=glcbt-66
Cleaning up project directory and file based variables
00:01
Job succeeded
```

I just wonder why this is not done in the first run which replace the rds instance and why the dependency is not automatically applied.

I can add a `depends_on` if needed but if it's mandatory this should be add to the documentation.


Regards,